---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures
source: html/10e96831-1cc3-5fdc-48b2-44223537ef7c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures

Error messages related to the DisplacementElement.

## Syntax (C#)
```csharp
public static class DisplacementElementFailures
```